{ "ros":
  [
    {"name": "TEST Institutions", "obligation": "Institutions shall provide the resolution authority with the latest approved annual financial statements available before the 31st of December of the year preceding the contribution period, together with the opinion submitted by the statutory auditor or audit firm, in accordance with Article 32 of Directive 2013/34/EU of the European Parliament and of the Council.", "concept":  "4587"},
    {"name": "TEST Resolution authorities", "obligation": "For the purpose of calculating the denominator provided for in the risk pillar referred to in Article 7(1)(c), by 15 February each year, resolution authorities shall provide the European Banking Authority (EBA) with the information received from all institutions established in their territory related to interbank liabilities and deposits referred to in Annex I at aggregate level."},
    {"name": "TEST Deposit guarantee schemes", "obligation": "By 31 January each year, deposit guarantee schemes shall provide resolution authorities with the calculation of the average amount of covered deposits in the previous year, calculated quarterly, of all their member credit institutions."},
    {"name": "TEST Competent authority", "obligation": " The competent authority shall not grant authorisation unless and until such time as it is fully satisfied that the applicant complies with all requirements under the provisions adopted pursuant to this Directive."},
    {"name": "TEST Investment firm", "obligation": "The investment firm shall provide all information, including a programme of operations setting out, inter alia, the types of business envisaged and the organisational structure, necessary to enable the competent authority to satisfy itself that the investment firm has established, at the time of initial authorisation, all the necessary arrangements to meet its obligations under this Chapter."},
    {"name": "TEST Applicant", "obligation": "An applicant shall be informed, within six months of the submission of a complete application, whether or not authorisation has been granted."},
    {"name": "TEST ESMA", "obligation": "ESMA shall develop draft regulatory technical standards to specify:\n(a) the information to be provided to the competent authorities under paragraph 2 of this Article including the programme of operations;\n(b) the requirements applicable to the management of investment firms under Article 9(6) and the information for the notifications under Article 9(5);\n(c) the requirements applicable to shareholders and members with qualifying holdings, as well as obstacles which may prevent effective exercise of the supervisory functions of the competent authority, under Article 10(1) and (2).\n ESMA shall submit those draft regulatory technical standards to the Commission by 3 July 2015. Power is delegated to the Commission to adopt the regulatory technical standards referred to in the first subparagraph in accordance with Articles 10 to 14 of Regulation (EU) No 1095/2010."}
  ]
}
